apache/nuttx/arch/arm/src/stm32l5/stm32l5_tim.c
#if STM32_NATIM > 0
  /* Advanced registers require Main Output Enable */

  if (((struct stm32_tim_priv_s *)dev)->base == STM32_TIM1_BASE ||
      ((struct stm32_tim_priv_s *)dev)->base == STM32_TIM8_BASE)
    {
      stm32_modifyreg16(dev, STM32_ATIM_BDTR_OFFSET, 0, ATIM_BDTR_MOE);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: stm32_tim_setclock
 ****************************************************************************/

static int stm32_tim_setclock(struct stm32_tim_dev_s *dev,
                                uint32_t freq)
{
  uint32_t freqin;
  int prescaler;

  DEBUGASSERT(dev != NULL);

  /* Disable Timer? */

  if (freq == 0)
    {
      stm32_tim_disable(dev);
      return 0;
    }

  /* Get the input clock frequency for this timer.  These vary with
   * different timer clock sources, MCU-specific timer configuration, and
   * board-specific clock configuration.  The correct input clock frequency
   * must be defined in the board.h header file.
   */

  switch (((struct stm32_tim_priv_s *)dev)->base)
    {
#ifdef CONFIG_STM32_TIM1
      case STM32_TIM1_BASE:
        freqin = STM32_TIM1_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM2
      case STM32_TIM2_BASE:
        freqin = STM32_TIM2_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM3
      case STM32_TIM3_BASE:
        freqin = STM32_TIM3_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM4
      case STM32_TIM4_BASE:
        freqin = STM32_TIM4_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM5
      case STM32_TIM5_BASE:
        freqin = STM32_TIM5_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM6
      case STM32_TIM6_BASE:
        freqin = STM32_TIM6_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM7
      case STM32_TIM7_BASE:
        freqin = STM32_TIM7_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM8
      case STM32_TIM8_BASE:
        freqin = STM32_TIM8_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM15
      case STM32_TIM15_BASE:
        freqin = STM32_TIM15_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM16
      case STM32_TIM16_BASE:
        freqin = STM32_TIM16_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM17
      case STM32_TIM17_BASE:
        freqin = STM32_TIM17_CLKIN;
        break;
#endif

      default:
        return -EINVAL;
    }

  /* Select a pre-scaler value for this timer using the input clock
   * frequency.
   */

  prescaler = freqin / freq;

  /* We need to decrement value for '1', but only, if that will not to
   * cause underflow.
   */

  if (prescaler > 0)
    {
      prescaler--;
    }

  /* Check for overflow as well. */

  if (prescaler > 0xffff)
    {
      prescaler = 0xffff;
    }

  stm32_putreg16(dev, STM32_GTIM_PSC_OFFSET, prescaler);
  stm32_tim_enable(dev);

  return prescaler;
}

/****************************************************************************
 * Name: stm32_tim_getclock
 ****************************************************************************/

static uint32_t stm32_tim_getclock(struct stm32_tim_dev_s *dev)
{
  uint32_t freqin;
  uint32_t clock;

  DEBUGASSERT(dev != NULL);

  /* Get the input clock frequency for this timer.  These vary with
   * different timer clock sources, MCU-specific timer configuration, and
   * board-specific clock configuration.  The correct input clock frequency
   * must be defined in the board.h header file.
   */

  switch (((struct stm32_tim_priv_s *)dev)->base)
    {
#ifdef CONFIG_STM32_TIM1
      case STM32_TIM1_BASE:
        freqin = STM32_TIM1_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM2
      case STM32_TIM2_BASE:
        freqin = STM32_TIM2_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM3
      case STM32_TIM3_BASE:
        freqin = STM32_TIM3_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM4
      case STM32_TIM4_BASE:
        freqin = STM32_TIM4_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM5
      case STM32_TIM5_BASE:
        freqin = STM32_TIM5_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM6
      case STM32_TIM6_BASE:
        freqin = STM32_TIM6_CLKIN;
        break;
#endif
#ifdef CONFIG_STM32_TIM7
      case STM32_TIM7_BASE:
        freqin = STM32_TIM7_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM8
      case STM32_TIM8_BASE:
        freqin = STM32_TIM8_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM15
      case STM32_TIM15_BASE:
        freqin = STM32_TIM15_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM16
      case STM32_TIM16_BASE:
        freqin = STM32_TIM16_CLKIN;
        break;
#endif

#ifdef CONFIG_STM32_TIM17
      case STM32_TIM17_BASE:
        freqin = STM32_TIM17_CLKIN;
        break;
#endif
      default:
        return -EINVAL;
    }

  /* From chip datasheet, at page 1179. */

  clock = freqin / (stm32_getreg16(dev, STM32_GTIM_PSC_OFFSET) + 1);
  return clock;
}

/****************************************************************************
 * Name: stm32_tim_setperiod
 ****************************************************************************/

static void stm32_tim_setperiod(struct stm32_tim_dev_s *dev,
                                uint32_t period)
{
  DEBUGASSERT(dev != NULL);
  stm32_putreg32(dev, STM32_GTIM_ARR_OFFSET, period);
}

/****************************************************************************
 * Name: stm32_tim_getperiod
 ****************************************************************************/

static uint32_t stm32_tim_getperiod (struct stm32_tim_dev_s *dev)
{
  DEBUGASSERT(dev != NULL);
  return stm32_getreg32 (dev, STM32_GTIM_ARR_OFFSET);
}

/****************************************************************************
 * Name: stm32_tim_getcounter
 ****************************************************************************/

static uint32_t stm32_tim_getcounter(struct stm32_tim_dev_s *dev)
{
  DEBUGASSERT(dev != NULL);
  uint32_t counter = stm32_getreg32(dev, STM32_GTIM_CNT_OFFSET);

  /* In datasheet page 988, there is a useless bit named UIFCPY in TIMx_CNT.
   * reset it it result when not TIM2 or TIM5.
   */

